<h1>Data Cleaning</h1>
<h2>Missing Data</h2>
<p>
    What is missing data?<br/>
    It depends on : <br/>
    <ul>
        <li>Origin of the data</li>
        <li>The context</li>
    </ul>
    <br/>
    A field that represents a salary with an empty value or 0 can be considered as a missing value.
 </p>

<h4>Numpy and missing values</h4>

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Falsy values in Python
falsy_values = (0, False, None, '', [], {})

In [3]:
any(falsy_values)

False

In [4]:
#Numpy has a special "nullable" value for numbers which is np.nan. It's _NaN_: "Not a number"
np.nan

nan

In [5]:
3 + np.nan

nan

In [6]:
#Every operation with np.nan will result a np.nan
li = np.array([1,2,3,4,np.nan])
print("Mean : {}.".format(li.mean()))
print("std  : {}.".format(li.std()))
print("Max  : {}.".format(li.max()))
print("Min  : {}.".format(li.min()))
print("Sum  : {}.".format(li.sum()))

Mean : nan.
std  : nan.
Max  : nan.
Min  : nan.
Sum  : nan.

In [7]:
#None is more strict than np.nan
try : 
    print(None + 3)
except :
    print("An error has detected!")

An error has detected!

In [8]:
#In numpy,None is converted into np.nan in some cases.
li = [1,2,3,5,6,None,3,None]
print("List        : {}.".format(li))
l = np.array(li,dtype = "float")
print("Numpy array : {}.".format(l))

List        : [1, 2, 3, 5, 6, None, 3, None].
Numpy array : [ 1.  2.  3.  5.  6. nan  3. nan].

In [9]:
#If you have any nan value in an array and you try to perform an operation on it, you'll get unexpected results.
l1 = np.array([1,2,3])
l2 = np.array([1,np.nan,np.nan])
print((l1+l2).sum())

nan

In [10]:
#Numpy also supports np.inf
np.inf

inf

In [11]:
1 < np.inf

True

In [12]:
1 > np.inf

False

In [13]:
1 > -np.inf

True

In [14]:
1 + np.inf

inf

In [15]:
np.nan + np.inf

nan

In [16]:
#Checking for np.nan and np.inf
print(np.isnan(np.nan))
print(np.isinf(np.inf))
print(np.isnan(np.inf))
print(np.isinf(np.nan))
try :
    print(np.isnan(None))
except :
    print("We can't use np.isnan with None.")

True
True
False
False
We can't use np.isnan with None.

In [17]:
li = np.array([1,2,3,np.nan,6,np.inf])

In [18]:
print(np.isnan(li))

[False False False  True False False]

In [19]:
print(np.isinf(li))

[False False False False False  True]

In [20]:
print(np.isfinite(li))

[ True  True  True False  True False]

In [21]:
~np.isfinite(li) == np.logical_or(np.isnan(li),np.isinf(li))

array([ True,  True,  True,  True,  True,  True])

In [22]:
#Filter np.nan values : To avoid np.nan propagation into the results of any operation.
print(li)

[ 1.  2.  3. nan  6. inf]

In [23]:
filtered = li[np.isfinite(li)]

In [24]:
print(filtered)

[1. 2. 3. 6.]

In [25]:
print("Sum before filtering : {}.".format(li.sum()))
print("Sum After filtering : {}.".format(filtered.sum()))

Sum before filtering : nan.
Sum After filtering : 12.0.

In [26]:
#Another way to filter
print(np.array(list(filter(lambda x : np.isfinite(x) , li))))

[1. 2. 3. 6.]

<h4>Pandas and misiing values</h4>

In [27]:
#Pandas can also detect null values and also can treat them well and easily.
none = None
null = np.nan
print(pd.isnull(none))
print(pd.isnull(null))
print(pd.isna(none))
print(pd.isna(null))

True
True
True
True

In [28]:
#Pandas can also detect null values and also can treat them well and easily.
none = None
null = np.nan
print(pd.notnull(none))
print(pd.notnull(null))
print(pd.notna(none))
print(pd.notna(null))

False
False
False
False

In [29]:
print(li)
print(pd.isnull(li))
print(pd.isna(li))

[ 1.  2.  3. nan  6. inf]
[False False False  True False False]
[False False False  True False False]

In [30]:
series = pd.Series([1,2,3,np.nan,None,np.inf,44])
dic = {"key1":[np.random.choice(li) for i in range(10)],"key2":[np.random.choice(li) for i in range(10)]}
dataframe = pd.DataFrame(dic)

In [31]:
series

0     1.0
1     2.0
2     3.0
3     NaN
4     NaN
5     inf
6    44.0
dtype: float64

In [32]:
dataframe

   key1  key2
0   inf   1.0
1   3.0   NaN
2   3.0   2.0
3   inf   6.0
4   6.0   inf
5   3.0   6.0
6   inf   1.0
7   2.0   2.0
8   2.0   NaN
9   2.0   1.0

In [33]:
print(series.isnull())

0    False
1    False
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [34]:
print(series.isna())

0    False
1    False
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [35]:
print(dataframe.isnull())

    key1   key2
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False   True
9  False  False

In [36]:
print(dataframe.isna())

    key1   key2
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False   True
9  False  False

In [37]:
#Pandas works more carefuly with np.nan, so it ignores np.nan.
nump = np.array([1,2,3,np.nan,6])
pand = pd.Series(nump)
print(nump)

[ 1.  2.  3. nan  6.]

In [38]:
print(pand)

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
dtype: float64

In [39]:
print(nump.sum()) #The result is nan

nan

In [40]:
print(pand.sum()) #The result is not nan

12.0

In [41]:
#Filtering missing values using pandas
print(series)

0     1.0
1     2.0
2     3.0
3     NaN
4     NaN
5     inf
6    44.0
dtype: float64

In [42]:
print(series[pd.notnull(series)])

0     1.0
1     2.0
2     3.0
5     inf
6    44.0
dtype: float64

In [43]:
#Droping null values using pandas 
print(series)

0     1.0
1     2.0
2     3.0
3     NaN
4     NaN
5     inf
6    44.0
dtype: float64

In [44]:
s = series.dropna()

In [45]:
print(s)

0     1.0
1     2.0
2     3.0
5     inf
6    44.0
dtype: float64

In [46]:
d = dataframe.dropna()

In [47]:
d

   key1  key2
0   inf   1.0
2   3.0   2.0
3   inf   6.0
4   6.0   inf
5   3.0   6.0
6   inf   1.0
7   2.0   2.0
9   2.0   1.0

<h4>Working with null values in a dataframe is more complicated!</h4>

In [48]:
df = pd.DataFrame({
    'Col1': [1, 2, 3, np.nan],
    'Col2': [2, 3, np.nan, 4],
    'Col3': [np.nan, np.nan, 6, 7],
    'Col4': [4, 5, 6, 7]})

In [49]:
df

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN     4
1   2.0   3.0   NaN     5
2   3.0   NaN   6.0     6
3   NaN   4.0   7.0     7

In [50]:
df.dropna()

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [51]:
df.shape

(4, 4)

In [52]:
df.info() #To know how many null values in each column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
Col1    3 non-null float64
Col2    3 non-null float64
Col3    2 non-null float64
Col4    4 non-null int64
dtypes: float64(3), int64(1)
memory usage: 208.0 bytes

In [53]:
#Another way to calcualte the number of null values in each column.
df.isnull()

    Col1   Col2   Col3   Col4
0  False  False   True  False
1  False  False   True  False
2  False   True  False  False
3   True  False  False  False

In [54]:
df.isnull().sum(axis = 0) # axis = 0 ---> apply the operation on each column,axis = 1 --> apply the operation on each row.

Col1    1
Col2    1
Col3    2
Col4    0
dtype: int64

In [55]:
df.isnull().sum(axis = 'rows')

Col1    1
Col2    1
Col3    2
Col4    0
dtype: int64

In [56]:
#By default dropna removes each row that contains at least one null value.
df.dropna()

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [57]:
df.dropna(axis = 0) #Here axis = 0 ---> refers to rows

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [58]:
df.dropna(axis = 'rows')

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [59]:
#To remove each column not row that contains at least one null value.
df.dropna(axis = 1)

   Col4
0     4
1     5
2     6
3     7

In [60]:
df.dropna(axis = 'columns')

   Col4
0     4
1     5
2     6
3     7

In [61]:
#By default, dropna removes rows that contain one null value at least.
#To remove columns instead of rows we use the "axis" parameter.
#To remove a row or column(depend on axis value) when its all values are null we use the "how" parameter.
print(df)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN     4
1   2.0   3.0   NaN     5
2   3.0   NaN   6.0     6
3   NaN   4.0   7.0     7

In [62]:
df.iloc[3] = [np.nan,np.nan,np.nan,np.nan]

In [63]:
print(df)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN

In [64]:
df.dropna()

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [65]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [66]:
df.dropna(how ="all") #Remove rows with just null values - Here the last row was removed

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0

In [67]:
df.dropna(axis = 1 , how = "all") #Remove columns with just null values - Here no column like this.

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN

In [68]:
#We can also specify the threshold for null values using the 'thresh' parameter.
print(df)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN

In [69]:
df.dropna()

Empty DataFrame
Columns: [Col1, Col2, Col3, Col4]
Index: []

In [70]:
df.dropna(thresh = 2) #Remove rows with at least 2 null values

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0

In [71]:
df.dropna(axis = 'columns',thresh = 2) #Remove columns with at least 2 null values

   Col1  Col2  Col4
0   1.0   2.0   4.0
1   2.0   3.0   5.0
2   3.0   NaN   6.0
3   NaN   NaN   NaN

<h4>Filling null values instead of droping them</h4>
<p>Sometimes instead than dropping the null values, we might need to replace them with some other value. This highly depends on your context and the dataset you're currently working.</p>

In [72]:
#Sometimes a nan can be replaced with a 0
print(df)
s = df.fillna(0)
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2  Col3  Col4
0   1.0   2.0   0.0   4.0
1   2.0   3.0   0.0   5.0
2   3.0   0.0   6.0   6.0
3   0.0   0.0   0.0   0.0

In [73]:
#Sometimes it can be replaced with the mean of the samples
print(df)
s = df.fillna(df.mean())
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2  Col3  Col4
0   1.0   2.0   6.0   4.0
1   2.0   3.0   6.0   5.0
2   3.0   2.5   6.0   6.0
3   2.0   2.5   6.0   5.0

In [74]:
#Sometimes it can be replaced with the value that is before it.(After applying this way null values can still remain)
#By default works with columns
print(df)
s = df.fillna(method = 'ffill')
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   3.0   6.0   6.0
3   3.0   3.0   6.0   6.0

In [75]:
#Sometimes it can be replaced with the value that is after it.(After applying this way null values can still remain)
#By defaut works with columns
print(df)
s = df.fillna(method = 'bfill')
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2  Col3  Col4
0   1.0   2.0   6.0   4.0
1   2.0   3.0   6.0   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN

In [76]:
#Sometimes it can be replaced with the value that is before it.(After applying this way null values can still remain)
#To make it works with rows
print(df)
s = df.fillna(method = 'ffill',axis = 'columns')
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2  Col3  Col4
0   1.0   2.0   2.0   4.0
1   2.0   3.0   3.0   5.0
2   3.0   3.0   6.0   6.0
3   NaN   NaN   NaN   NaN

In [77]:
#Sometimes it can be replaced with the value that is after it.(After applying this way null values can still remain)
#To make it works with rows
print(df)
s = df.fillna(method = 'bfill',axis = 'columns')
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2  Col3  Col4
0   1.0   2.0   4.0   4.0
1   2.0   3.0   5.0   5.0
2   3.0   6.0   6.0   6.0
3   NaN   NaN   NaN   NaN

In [78]:
#With dataframes we can specify a different way to treat null values in each columns
print(df)
s = df.fillna({'Col1' : 0 , 'Col2' : df['Col2'].mean() , 'Col3' : 'hi',"Col4" : "Bye"})
print("-------------------------")
print(s)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN
-------------------------
   Col1  Col2 Col3 Col4
0   1.0   2.0   hi    4
1   2.0   3.0   hi    5
2   3.0   2.5    6    6
3   0.0   2.5   hi  Bye

In [79]:
#How to check if there is any null values in a dataframe or series ?
print(df)

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   4.0
1   2.0   3.0   NaN   5.0
2   3.0   NaN   6.0   6.0
3   NaN   NaN   NaN   NaN

In [80]:
print(df.count())

Col1    3
Col2    2
Col3    1
Col4    3
dtype: int64

In [81]:
print(df.dropna().count())

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [82]:
if(df.count().sum() == df.dropna().count().sum()) :
    print("There is'nt null values.")
else :
    print("There is null values.")

There is null values.

In [83]:
#Or we can use any or all
if(df.notnull().values.all()) :
    print("There is'nt null values.")
else :
    print("There is null values.")

There is null values.

In [84]:
#Or we can use any or all
if(not df.isnull().values.any()) :
    print("There is'nt null values.")
else :
    print("There is null values.")

There is null values.

<h4>Cleaning and dealing with not null values</h4>
<p>
    When all misiing values are np.nan, you're in a great situation.<br/>
    You can just use pd.isnull, pd.dropna  and pd.fillna to clean the missing values and that's it.<br/>
    But sometimes and more often you deal with invalid values that are not np.nan.
</p>

In [85]:
age_list = [np.random.randint(18,80) if np.random.randint(0,2) == 0 else np.random.randint(18,80)*10 for counter in range(10) ]
sex_list = [np.random.choice(['F','M','?']) for i in range(10)]
age_list.append(210)
sex_list.append("D")
dic = {
    'age' : age_list ,
    'sex' : sex_list
}
df = pd.DataFrame(dic)

In [86]:
df

    age sex
0   460   M
1    21   ?
2   550   F
3    44   ?
4   380   ?
5    76   ?
6   420   ?
7    66   ?
8    54   M
9   480   F
10  210   D

In [87]:
#Exploring the dataset's values
for col in df.columns :
    print("With {} column :\n {}. ".format(col,df[col].value_counts()))

With age column :
 76     1
54     1
460    1
380    1
210    1
550    1
21     1
420    1
66     1
44     1
480    1
Name: age, dtype: int64.
With sex column :
 ?    6
F    2
M    2
D    1
Name: sex, dtype: int64.

In [88]:
#Finding unique values
for col in df.columns :
    print("With {} column :\n {}. ".format(col,df[col].unique()))

With age column :
 [460  21 550  44 380  76 420  66  54 480 210].
With sex column :
 ['M' '?' 'F' 'D'].

In [89]:
#Now we can correct invalid values
#If we have one value in one column to replace
df['sex'].replace('?',"M")

0     M
1     M
2     F
3     M
4     M
5     M
6     M
7     M
8     M
9     F
10    D
Name: sex, dtype: object

In [90]:
#If we have many values in one column to replace.
df['sex'].replace({"?":"M","D":"F"})

0     M
1     M
2     F
3     M
4     M
5     M
6     M
7     M
8     M
9     F
10    F
Name: sex, dtype: object

In [91]:
#If we have many values in many columns to replace
df.replace({
    'sex' : {
        '?' : "M" ,
        'D' : "F"
    },
    'age' : {
        210 : 21
    }
})

    age sex
0   460   M
1    21   M
2   550   F
3    44   M
4   380   M
5    76   M
6   420   M
7    66   M
8    54   M
9   480   F
10   21   F

In [92]:
#Correcting all wrong ages
df.loc[df['age'] > 100,'age'] = df.loc[df['age'] > 100,'age'] / 10

In [93]:
df

     age sex
0   46.0   M
1   21.0   ?
2   55.0   F
3   44.0   ?
4   38.0   ?
5   76.0   ?
6   42.0   ?
7   66.0   ?
8   54.0   M
9   48.0   F
10  21.0   D

<h4>Dealing with duplicates</h4>

In [94]:
singer = ["Lady Gaga","Najwa Karam","Nawal Alzoghbi","Selena Gomez","Sia","Indila","Celine Dion","Assi Alhalany"]
ids = []
singers = []
df = pd.DataFrame()
for i in range(20) :
    ids.append(np.random.randint(1,4))
    singers.append(np.random.choice(singer))
df["id"] = ids
df["singer"] = singers
df

    id          singer
0    1    Selena Gomez
1    2     Najwa Karam
2    1             Sia
3    2          Indila
4    3    Selena Gomez
5    2   Assi Alhalany
6    1     Najwa Karam
7    1             Sia
8    2   Assi Alhalany
9    3  Nawal Alzoghbi
10   2     Celine Dion
11   1             Sia
12   2     Celine Dion
13   1       Lady Gaga
14   2   Assi Alhalany
15   3     Celine Dion
16   3   Assi Alhalany
17   2       Lady Gaga
18   3   Assi Alhalany
19   3       Lady Gaga

In [95]:
#We want to detect duplicated singers - it considers the first instance as not dublicate
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8      True
9     False
10    False
11     True
12     True
13    False
14     True
15    False
16    False
17    False
18     True
19    False
dtype: bool

In [96]:
df.duplicated(keep = 'last') # here we reverse the situation - the last considered as not duplicate

0     False
1     False
2      True
3     False
4     False
5      True
6     False
7      True
8      True
9     False
10     True
11    False
12    False
13    False
14    False
15    False
16     True
17    False
18    False
19    False
dtype: bool

In [97]:
df.duplicated(keep = False) #Here we considere all duplicates as duplicates without execluding the first or last instance.

0     False
1     False
2      True
3     False
4     False
5      True
6     False
7      True
8      True
9     False
10     True
11     True
12     True
13    False
14     True
15    False
16     True
17    False
18     True
19    False
dtype: bool

In [98]:
df.duplicated(subset = ["singer"],keep = "first")

0     False
1     False
2     False
3     False
4      True
5     False
6      True
7      True
8      True
9     False
10    False
11     True
12     True
13    False
14     True
15     True
16     True
17     True
18     True
19     True
dtype: bool

In [99]:
df[~df.duplicated(subset = ["singer"],keep = "first")]

    id          singer
0    1    Selena Gomez
1    2     Najwa Karam
2    1             Sia
3    2          Indila
5    2   Assi Alhalany
9    3  Nawal Alzoghbi
10   2     Celine Dion
13   1       Lady Gaga

In [100]:
df.drop_duplicates()

    id          singer
0    1    Selena Gomez
1    2     Najwa Karam
2    1             Sia
3    2          Indila
4    3    Selena Gomez
5    2   Assi Alhalany
6    1     Najwa Karam
9    3  Nawal Alzoghbi
10   2     Celine Dion
13   1       Lady Gaga
15   3     Celine Dion
16   3   Assi Alhalany
17   2       Lady Gaga
19   3       Lady Gaga

In [101]:
df.drop_duplicates(keep = 'last')

    id          singer
0    1    Selena Gomez
1    2     Najwa Karam
3    2          Indila
4    3    Selena Gomez
6    1     Najwa Karam
9    3  Nawal Alzoghbi
11   1             Sia
12   2     Celine Dion
13   1       Lady Gaga
14   2   Assi Alhalany
15   3     Celine Dion
17   2       Lady Gaga
18   3   Assi Alhalany
19   3       Lady Gaga

In [102]:
df.drop_duplicates(subset = ['singer'])

    id          singer
0    1    Selena Gomez
1    2     Najwa Karam
2    1             Sia
3    2          Indila
5    2   Assi Alhalany
9    3  Nawal Alzoghbi
10   2     Celine Dion
13   1       Lady Gaga

In [103]:
df.drop_duplicates(subset = ['singer'],keep = 'last')

    id          singer
3    2          Indila
4    3    Selena Gomez
6    1     Najwa Karam
9    3  Nawal Alzoghbi
11   1             Sia
15   3     Celine Dion
18   3   Assi Alhalany
19   3       Lady Gaga

<h4>Text Handling</h4>

In [104]:
#Splitting columns
df = pd.DataFrame({
    "Data" : [
        '1,22, F,2018-2-20',
        '2,33,F ,2018-4-2',
        '3,32,  F  ,2018-2-3',
        '4,23,F,2018-5-20',
        '5,34,F,2018-7-2',
    ]
})
df

                  Data
0    1,22, F,2018-2-20
1     2,33,F ,2018-4-2
2  3,32,  F  ,2018-2-3
3     4,23,F,2018-5-20
4      5,34,F,2018-7-2

In [105]:
#spliting one column to many
df.Data.str.split(","),type(df.Data.str.split(","))

(0      [1, 22,  F, 2018-2-20]
 1       [2, 33, F , 2018-4-2]
 2    [3, 32,   F  , 2018-2-3]
 3       [4, 23, F, 2018-5-20]
 4        [5, 34, F, 2018-7-2]
 Name: Data, dtype: object, pandas.core.series.Series)

In [106]:
df.Data.str.split(",",expand = True)

   0   1      2          3
0  1  22      F  2018-2-20
1  2  33     F    2018-4-2
2  3  32    F     2018-2-3
3  4  23      F  2018-5-20
4  5  34      F   2018-7-2

In [107]:
df2 = df.Data.str.split(",",expand = True)
df2.columns = ['id','age','sex','hire_date']
df2

  id age    sex  hire_date
0  1  22      F  2018-2-20
1  2  33     F    2018-4-2
2  3  32    F     2018-2-3
3  4  23      F  2018-5-20
4  5  34      F   2018-7-2

In [108]:
#Define rows when hire_date has only nine digits
df2.hire_date.str.contains("[0-9\-]{9}")

0     True
1    False
2    False
3     True
4    False
Name: hire_date, dtype: bool

In [109]:
#To avoid spaces before and after a string
df2.sex.str.strip()

0    F
1    F
2    F
3    F
4    F
Name: sex, dtype: object

In [110]:
df2.sex

0        F
1       F
2      F
3        F
4        F
Name: sex, dtype: object

In [111]:
#avoid spaces before a string
df2.sex.str.rstrip()

0      F
1      F
2      F
3      F
4      F
Name: sex, dtype: object

In [112]:
#avoid spaces after a string
df2.sex.str.lstrip()

0      F
1     F
2    F
3      F
4      F
Name: sex, dtype: object

<h1>20/12/2020</h1>